length = int(input())
height = int(input())
width = int(input())
botls = int(input())

cube = length * height * width

result = cube // botls
print(result)

"""
В новый аквариум нужно налить чистой воды. Напишите программу, которая определит,
 сколько бутылок воды нужно купить, чтобы заполнить аквариум полностью.
"""