substring = input()


"""
Проведите небольшое исследование введённых строк и запишите результаты в табличку.

Вводится подстрока для проверки остальных трёх строк, затем вводятся ещё три строки.

Сначала выведите заголовки таблички:
Строка<выравнивание пробелами до 10 символов>:число

Затем выведите табличку, в которой напротив каждой введённой строки для проверки после двоеточия запишите 1, если подстрока, введённая первой, есть в этой строке, 10, если подстроки нет, и 111, если строка полностью совпадает с введённой подстрокой.

На левую часть таблички отведите 10 символов, не считая двоеточия. На число — 5 символов.
"""