s = ''
leter = input()

while leter != '':
    s += (leter + ' ')
    leter = input()

print(s)

"""
Напишите программу, которая записывает в одну строку через пробел имена всех пришедших гостей.

Имена вводятся, пока не будет введена пустая строка.
"""