str1 = input()
str2 = input()

print(f"{str1}-{str2}")

"""
Напишите программу, которая считывает две строки и выводит их через дефис.
"""