str1 = input()
str2 = input()

result = sorted([str1, str2])

print(f'{result[0]}, {result[1]}')

"""
Выведите две введённые строки в лексикографическом порядке через запятую и пробел.
"""