str1 = input()
str2 = input()

if str1> str2:
    print(f'{str1}, {str2}')
else:
    print(f'{str2}, {str1}')

"""
Выведите две введённые строки в лексикографическом порядке через запятую и пробел.
"""