str1 = input()
str2 = input()

if str1[0].isupper()> str2[0].isupper():
    print(f'{str1}, {str2}')
elif str2[0].isupper() > str1[0].isupper():
    print(f'{str2}, {str1}')
elif str1[0]()> str2[0]:
    print(f'{str1}, {str2}')
elif str2[0] > str1[0]:
    print(f'{str2}, {str1}')
elif str1 > str2:
    print(f'{str1}, {str2}')
elif str2 > str1:
    print(f'{str2} , {str1}')

"""
Выведите две введённые строки в лексикографическом порядке через запятую и пробел.
"""