n = int(input())
m = int(input())
d = int(input())

res = n * m + d
print(res)


"""
Как поделить коробку конфет поровну между всеми детьми?

Напишите программу, которая определит, сколько конфет было в коробке, 
если каждому из n детей досталось по m конфет и ещё d конфет осталось.

Формат ввода
Вводятся целые числа n, m и d.

"""