name1 = input()
name2 = input()
name3 = input()
name4 = input()
name5 = input()
name6 = input()
name7 = input()
name8 = input()

print(f"""
Побежали на качели
{name1} , {name2} , {name3} , {name4} ,
Раскачали их на славу
{name5} , {name6} , {name7} .
Загорал один {name8} .
Лучше б он, как ты, водил!
""")

"""
Напишите программу, которая вставит введённые пользователем имена в считалочку:

Побежали на качели
<1 имя> , <2 имя> , <3 имя> , <4 имя> ,
Раскачали их на славу
<5 имя> , <6 имя> , <7 имя> .
Загорал один <8 имя> .
Лучше б он, как ты, водил!
"""