str1 = input()
str2 = input()
str3 = input()

print(str1 + str2 * 2 + str3)

"""
Напишите программу, которая читает три строки, а затем выводит их в таком порядке: 
первую, затем удвоенную вторую, затем третью.

Для удвоения обязательно используйте умножение строк.
"""