n = input()

if bool(n) == False:
    print("Пустота!")
else:
    print(n)

"""

Напишите программу, которая определяет, ввёл пользователь пустую строку или непустую.

Если строка пуста (пользователь сразу нажал Enter), 
то выведите «Пустота!», иначе выведите саму введённую строку.

"""